using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class PlanTXT : MonoBehaviour
{
    /*
     * подсветка выбранной башни

     * Форт-спавнер, сам атакует врагов
     * тип врагов, которые бьют форт, а не умирают
     * замораживающая башня, массовая башня
     * 
     * Бесконечная защита (сейчас), на прохождение уровней
     * Таблица результатов с сохранением
     * 

     * */

    //будущее
    /*расы: нежить - юниты отравляют вражеских юнитов, орки не камикадзе, люди стреляют, ангелы лечатся
     * Добавить абилки, удар молнии, стена огня, лечение, отравление, замедление, ускорение
     * Добавить уникальных юнитов: лечит ближайших, увеличивает атаку ближайших, ++броня
     * 
     * 
     * */


    /* 27.02.20

     * Создать список эффектов и их воздействие (урон, заморозка, замедление, масс атака)
   
     * 

     * 
     * 
     * 
     * 
     * */

}
