using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class PlanTXT : MonoBehaviour
{
    /*
     * Снятие денег при покупке, поменять подсветку пустых ячеек, подсветка башен, подсветка выбранной башни
     * Дестроить башни
     * Форт-спавнер, сам атакует врагов
     * тип врагов, которые бьют форт, а не умирают
     * замораживающая башня, массовая башня
     * 
     * Бесконечная защита (сейчас), на прохождение уровней
     * Таблица результатов с сохранением
     * 
     * Поиск цели башни не через GameObjectFind, а лучами по окружности в зависимости от range
     * */

    //будущее
    /*расы: нежить - юниты отравляют вражеских юнитов, орки не камикадзе, люди стреляют, ангелы лечатся
     * Добавить абилки, удар молнии, стена огня, лечение, отравление, замедление, ускорение
     * Добавить уникальных юнитов: лечит ближайших, увеличивает атаку ближайших, ++броня
     * 
     * 
     * */


}
